app/Controllers/Funcionarios/Funcionarios.php

    public function index()
    {
        $funcionarios = $this->funcionario_model->findAll();
---
SELECT *
FROM `funcionarios`