app/Controllers/Produtos/Produtos.php

SELECT *
FROM `produtos`
---
    public function index()
    {
        $produtos = $this->produto_model->findAll();