app/Controllers/Inicio.php

    public function index()
    {

        $total_de_produtos = count($this->produto_model->findAll());
        $total_de_funcionarios = count($this->funcionario_model->findAll());
        $total_de_clientes = count($this->cliente_model->findAll());
---
SELECT *
FROM `produtos`
SELECT *
FROM `funcionarios`
SELECT *
FROM `clientes`