app/Controllers/Clientes/Clientes.php

        public function index()
{

    $clientes = $this ->cliente_model
    ->findAll();
---
SELECT *
FROM `clientes`